Tekla Open API Reference for Tekla Structures 2025
FacetedBrep.OuterWires Property
 Gets the outer wires.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int[][] OuterWires { get; }
Public ReadOnly Property OuterWires As Integer()()
	Get
Property Value
Type: Int32[][]
See Also
Reference
FacetedBrep Class
Tekla.Structures.Geometry3d Namespace